pruebas/prueba.yaml

execution:
  - executor: jmeter   # Especifica que se usará JMeter
    concurrency: 1     # Número de usuarios virtuales concurrentes
    ramp-up: 3s       # Tiempo para alcanzar la concurrencia completa
    hold-for: 10s      # Duración de la prueba a plena carga
    scenario: api-test
    
scenarios:
  api-test:
    requests:
      - url: http://localhost:8000/actors
        method: GET
        label: get-actors
      - url: http://localhost:8000/movies
        method: GET
        label: get-movies
      - url: http://localhost:8000/customers
        method: GET
        label: get-customers

reporting:
  - module: console
  - module: final-stats
    summary: true
    percentiles: true 
    failed-labels: false
    test-duration: true
    dump-csv: TaurusResult/perf_result_csv.csv
  - module: junit-xml
    data-source: pass-fail
    filename: TaurusResult/junit-result.xml
  - module: blazemeter
    report-name: Taurus test report
    test: Taurus test
    project: Taurus test project

settings:
  check-interval: 2s  # intervalo para recopilar métricas
  verbose: false      # más detalles en la salida de consola


modules:
  blazemeter:
    token: d5d1c81cc84d9e67a8af15a0:da65597d5df182300f41cc14e2bea4aba9a1caa43c3e843a63205e5c02b81d47992772e6